Revit 2027 API
InstanceBinding Properties
The InstanceBinding type exposes the following members.
Properties
Name | Description
Categories | Retrieve or set the categories to which a parameter definition will be bound.
(Inherited from ElementBinding)
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Top
See Also
Reference
InstanceBinding Class
Autodesk.Revit.DB Namespace